// Generated by jextract

package com.github.gotson.nightcompress.panama;

import java.lang.invoke.VarHandle;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$21 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$21() {}
    static final VarHandle const$0 = constants$20.const$4.varHandle(MemoryLayout.PathElement.groupElement("_size"));
    static final StructLayout const$1 = MemoryLayout.structLayout(
        RuntimeHelper.POINTER.withName("_p"),
        JAVA_INT.withName("_r"),
        JAVA_INT.withName("_w"),
        JAVA_SHORT.withName("_flags"),
        JAVA_SHORT.withName("_file"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("_base"),
            JAVA_INT.withName("_size"),
            MemoryLayout.paddingLayout(4)
        ).withName("_bf"),
        JAVA_INT.withName("_lbfsize"),
        MemoryLayout.paddingLayout(4),
        RuntimeHelper.POINTER.withName("_cookie"),
        RuntimeHelper.POINTER.withName("_close"),
        RuntimeHelper.POINTER.withName("_read"),
        RuntimeHelper.POINTER.withName("_seek"),
        RuntimeHelper.POINTER.withName("_write"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("_base"),
            JAVA_INT.withName("_size"),
            MemoryLayout.paddingLayout(4)
        ).withName("_ub"),
        RuntimeHelper.POINTER.withName("_extra"),
        JAVA_INT.withName("_ur"),
        MemoryLayout.sequenceLayout(3, JAVA_BYTE).withName("_ubuf"),
        MemoryLayout.sequenceLayout(1, JAVA_BYTE).withName("_nbuf"),
        MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("_base"),
            JAVA_INT.withName("_size"),
            MemoryLayout.paddingLayout(4)
        ).withName("_lb"),
        JAVA_INT.withName("_blksize"),
        MemoryLayout.paddingLayout(4),
        JAVA_LONG.withName("_offset")
    ).withName("__sFILE");
    static final VarHandle const$2 = constants$21.const$1.varHandle(MemoryLayout.PathElement.groupElement("_p"));
    static final VarHandle const$3 = constants$21.const$1.varHandle(MemoryLayout.PathElement.groupElement("_r"));
    static final VarHandle const$4 = constants$21.const$1.varHandle(MemoryLayout.PathElement.groupElement("_w"));
    static final VarHandle const$5 = constants$21.const$1.varHandle(MemoryLayout.PathElement.groupElement("_flags"));
}


